mariopartyrd/partyboard/src/REL/m408Dll/camera.c
#include "game/audio.h"
#include "game/chrman.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/wipe.h"
#include "game/hsfanim.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/sprite.h"

#include "REL/m408Dll.h"

#include "ext_math.h"
#include "math.h"
#include "version.h"

#ifndef __MWERKS__
#include "game/frand.h"
#endif

omObjData *lbl_1_bss_110;
u32 lbl_1_bss_10C;
Vec lbl_1_bss_100;
Vec lbl_1_bss_F4;
HU3DPARTICLEDATA *lbl_1_bss_A4[20];
u32 lbl_1_bss_A0;
HU3DPARTICLEDATA *lbl_1_bss_94[3];
s32 lbl_1_bss_88[3];
s32 lbl_1_bss_84;
s32 lbl_1_bss_80;

void fn_1_8A20(omObjData *object);
void fn_1_9770(omObjData *object);

void fn_1_8958(Process *objman)
{
    omObjData *object;
    lbl_1_bss_10C = 0;
    object = omAddObjEx(objman, 20, 9, 0, -1, fn_1_8A20);
    object->work[0] = 0;
    lbl_1_bss_110 = omAddObjEx(objman, 21, 2, 0, -1, fn_1_9770);
    lbl_1_bss_110->work[0] = 0;
    lbl_1_bss_84 = lbl_1_bss_80 = -1;
}

void fn_1_8FAC(omObjData *object);

void fn_1_A894(ModelData *model, ParticleData *particle, Mtx matrix);
void fn_1_B700(s16 arg0, u32 arg1);
void fn_1_BB94(void);
void fn_1_BDE0(void);

void fn_1_8A20(omObjData *object)
{
    s16 temp_r31;
    s32 temp_r29;
    for (temp_r29 = 0; temp_r29 < 20; temp_r29++) {
        lbl_1_bss_A4[temp_r29] = NULL;
    }
    lbl_1_bss_A0 = 0;
    for (temp_r29 = 0; temp_r29 < 3; temp_r29++) {
        lbl_1_bss_94[temp_r29] = NULL;
        lbl_1_bss_88[temp_r29] = 0;
    }
    object->model[0] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M408, 0x00));
    omSetSca(object, 0.1f, 0.1f, 0.1f);
    object->model[1] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M408, 0x01));
    Hu3DModelScaleSet(object->model[1], 0.1f, 0.1f, 0.1f);
    Hu3DModelPosSet(object->model[1], 0, 11990, 0);
    Hu3DModelShadowMapSet(object->model[1]);
    temp_r31 = Hu3DParticleCreate(HuSprAnimReadFile(DATA_MAKE_NUM(DATADIR_M408, 0x0B)), 1);
    object->model[2] = temp_r31;
    Hu3DModelLayerSet(temp_r31, 6);
    Hu3DParticleColSet(temp_r31, 255, 255, 255);
    Hu3DParticleHookSet(temp_r31, fn_1_A894);
    Hu3DModelPosSet(temp_r31, 0, 0, 0);
    ((ParticleData *)Hu3DData[temp_r31].unk_120)->unk_00 = 0;
    ((ParticleData *)Hu3DData[temp_r31].unk_120)->unk_02 = 0;
    temp_r31 = Hu3DParticleCreate(HuSprAnimReadFile(DATA_MAKE_NUM(DATADIR_M408, 0x0D)), 1);
    object->model[3] = temp_r31;
    Hu3DParticleBlendModeSet(temp_r31, 1);
    Hu3DModelLayerSet(temp_r31, 6);
    Hu3DParticleColSet(temp_r31, 255, 255, 255);
    Hu3DParticleHookSet(temp_r31, fn_1_A894);
    Hu3DModelPosSet(temp_r31, 0, 0, 0);
    ((ParticleData *)Hu3DData[temp_r31].unk_120)->unk_00 = 0;
    ((ParticleData *)Hu3DData[temp_r31].unk_120)->unk_02 = 1;
    temp_r31 = Hu3DParticleCreate(HuSprAnimReadFile(DATA_MAKE_NUM(DATADIR_M408, 0x11)), 1);
    object->model[5] = temp_r31;
    Hu3DModelLayerSet(temp_r31, 7);
    Hu3DParticleColSet(temp_r31, 255, 255, 255);
    Hu3DParticleHookSet(temp_r31, fn_1_A894);
    Hu3DModelPosSet(temp_r31, 0, 0, 0);
    ((ParticleData *)Hu3DData[temp_r31].unk_120)->unk_00 = 0;
    ((ParticleData *)Hu3DData[temp_r31].unk_120)->unk_02 = 2;
    temp_r31 = Hu3DParticleCreate(HuSprAnimReadFile(DATA_MAKE_NUM(DATADIR_M408, 0x10)), 8);
    object->model[6] = temp_r31;
    Hu3DParticleBlendModeSet(temp_r31, 1);
    Hu3DModelLayerSet(temp_r31, 6);
    Hu3DModelPosSet(temp_r31, 0, 0, 0);
    fn_1_B700(temp_r31, 0);
    temp_r31 = Hu3DParticleCreate(HuSprAnimReadFile(DATA_MAKE_NUM(DATADIR_M408, 0x0F)), 6);
    object->model[6] = temp_r31;
    Hu3DParticleBlendModeSet(temp_r31, 1);
    Hu3DModelLayerSet(temp_r31, 6);
    Hu3DModelPosSet(temp_r31, 0, 0, 0);
    fn_1_B700(temp_r31, 1);
    temp_r31 = Hu3DParticleCreate(HuSprAnimReadFile(DATA_MAKE_NUM(DATADIR_M408, 0x0D)), 5);
    object->model[6] = temp_r31;
    Hu3DParticleBlendModeSet(temp_r31, 1);
    Hu3DModelLayerSet(temp_r31, 6);
    Hu3DModelPosSet(temp_r31, 0, 0, 0);
    fn_1_B700(temp_r31, 2);
    fn_1_BB94();
    lbl_1_bss_10C = 1;
    object->func = fn_1_8FAC;
    object->work[1] = 0;
}

void fn_1_9514(omObjData *object);

void fn_1_8FAC(omObjData *object)
{
    object->work[1]++;
    switch (lbl_1_bss_10C) {
        case 1:
            if (lbl_1_bss_110->work[0] == 4) {
                lbl_1_bss_10C = 2;
                fn_1_817C(&lbl_1_bss_100, &lbl_1_bss_F4);
                object->work[1] = 0;
            }
            break;

        case 2:
            fn_1_817C(&lbl_1_bss_100, &lbl_1_bss_F4);
            if (lbl_1_bss_80 < 0) {
                lbl_1_bss_80 = HuAudFXPlay(1361);
            }
            lbl_1_bss_10C = 3;
            object->work[1] = 0;
            break;

        case 3:
#if VERSION_PAL
            lbl_1_bss_F4.y += -400.0f / REFRESH_RATE_F;
            lbl_1_bss_F4.z += -35.0f / REFRESH_RATE_F;
            lbl_1_bss_100.y += 20.0f / 50.000005f;
#else
            lbl_1_bss_F4.y += -400.0f / REFRESH_RATE_OFF_BY_1;
            lbl_1_bss_F4.z += -35.0f / REFRESH_RATE_OFF_BY_1;
            lbl_1_bss_100.y += 20.0f / 60.0f;
#endif
            fn_1_817C(&lbl_1_bss_100, &lbl_1_bss_F4);
            if (lbl_1_bss_F4.y > 12010) {
                break;
            }
            if (lbl_1_bss_84 < 0) {
                lbl_1_bss_84 = HuAudFXPlay(1357);
            }
            if (lbl_1_bss_80 >= 0) {
                HuAudFXStop(lbl_1_bss_80);
                lbl_1_bss_80 = -1;
            }
            lbl_1_bss_10C = 4;
            object->work[1] = 0;
            object->work[2] = 0;
            break;

        case 4:
#if VERSION_PAL
            if (object->work[1] < 20.0f) {
                lbl_1_bss_100.y += 0.39999998f;
#else
            if (object->work[1] < 24.0f) {
                lbl_1_bss_100.y += 4.0f / 12.0f;
#endif
                fn_1_817C(&lbl_1_bss_100, &lbl_1_bss_F4);
            }
            else {
                if (object->work[2] == 0) {
                    if (!lbl_1_bss_40) {
                        WipeCreate(WIPE_MODE_OUT, WIPE_TYPE_NORMAL, -1);
                        lbl_1_bss_44 = 1;
                    }
                    object->work[2]++;
                }
#if VERSION_PAL
                CZoom -= 3.0f;
#else
                CZoom -= 2.5000002f;
#endif
#if VERSION_PAL
                if (object->work[1] < 75.0f) {
#else
                if (object->work[1] < 90.0f) {
#endif
                    break;
                }
                lbl_1_bss_10C = 5;
                object->work[1] = 0;
            }
            break;

        default:
            lbl_1_bss_10C = 5;
            break;
    }
    omSetTra(object, Center.x + (sind(CRot.y) * cosd(CRot.x) * CZoom), Center.y + (-sind(CRot.x) * CZoom),
        Center.z + (cosd(CRot.y) * cosd(CRot.x) * CZoom));
    fn_1_BDE0();
    if (lbl_1_bss_10C == 5) {
        Hu3DModelAttrSet(object->model[0], HU3D_ATTR_DISPOFF);
        Hu3DModelAttrSet(object->model[1], HU3D_ATTR_DISPOFF);
        lbl_1_bss_10C = 5;
        object->func = fn_1_9514;
    }
}

void fn_1_9514(omObjData *object)
{
    if (!WipeStatGet() && object->work[2] != 0) {
        if (!lbl_1_bss_40) {
            WipeCreate(WIPE_MODE_IN, WIPE_TYPE_NORMAL, -1);
            lbl_1_bss_44 = 0;
        }
        object->work[2] = 0;
    }
    if (fn_1_6878() >= 4) {
        Hu3DModelAttrReset(object->model[0], HU3D_ATTR_DISPOFF);
    }
    omSetTra(object, Center.x + (sind(CRot.y) * cosd(CRot.x) * CZoom), Center.y + (-sind(CRot.x) * CZoom) - 1000,
        Center.z + (cosd(CRot.y) * cosd(CRot.x) * CZoom));
}

