mariopartyrd/partyboard/src/REL/m408Dll/camera.c
typedef struct work_99C8 {
    Vec unk0;
    Vec unkC;
    Vec unk18;
    Vec unk24;
    Vec unk30;
    Vec unk3C;
    s32 unk48[2];
} Work99C8;

void fn_1_99C8(omObjData *object);
void fn_1_A37C(ModelData *model, ParticleData *particle, Mtx matrix);

void fn_1_9770(omObjData *object)
{
    Work99C8 *temp_r31;
    s32 temp_r29;

    object->data = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(Work99C8), MEMORY_DEFAULT_NUM);
    temp_r31 = object->data;
    object->model[0] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M408, 0x0A));
    Hu3DModelAttrSet(object->model[0], HU3D_MOTATTR_LOOP);
    Hu3DMotionSpeedSet(object->model[0], 3.0f);
    Hu3DModelShadowSet(object->model[0]);
    object->func = fn_1_99C8;
    object->work[0] = 0;
    object->work[1] = 0;
    temp_r31->unk3C.x = temp_r31->unk3C.y = temp_r31->unk3C.z = 0;
    temp_r31->unk0.x = temp_r31->unk0.y = temp_r31->unk0.z = 0;
    temp_r31->unk0.z = 1000;
    omSetTra(object, 0, 12080, -2 * temp_r31->unk0.z);
    omSetSca(object, 0.5f, 0.5f, 0.5f);
    temp_r29 = Hu3DParticleCreate(HuSprAnimReadFile(DATA_MAKE_NUM(DATADIR_M408, 0x24)), 1024);
    object->model[1] = temp_r29;
    Hu3DModelLayerSet(temp_r29, 6);
    Hu3DParticleColSet(temp_r29, 255, 255, 255);
    Hu3DParticleHookSet(temp_r29, fn_1_A37C);
    Hu3DModelPosSet(temp_r29, 0, 0, 0);
    ((ParticleData *)Hu3DData[temp_r29].unk_120)->unk_00 = 0;
    temp_r31->unk30.y = -35;
    temp_r31->unk30.z = 350;
    temp_r31->unk18.y = 800 + object->trans.y;
    temp_r31->unk48[0] = temp_r31->unk48[1] = -1;
    HuDataDirClose(DATA_MAKE_NUM(DATADIR_M408, 10));
}

void fn_1_A334(omObjData *object);
void fn_1_A4E8(s32 arg0, Vec *arg1, u32 arg2);

void fn_1_99C8(omObjData *object)
{
    float temp_f31;
    float temp_f30;

    Vec sp2C;
    Vec sp20;
    Vec sp14;
    Vec sp8;

    Work99C8 *temp_r31;
    temp_r31 = object->data;
    object->trans.x += temp_r31->unk0.x * REFRESH_FREQ;
    object->trans.y += temp_r31->unk0.y * REFRESH_FREQ;
    object->trans.z += temp_r31->unk0.z * REFRESH_FREQ;
    object->work[1]++;
    switch (object->work[0]) {
        case 0:
            if (object->work[1] < REFRESH_RATE_F * 2) {
                temp_f30 = REFRESH_FREQ * (1.5f * (REFRESH_RATE_F * 2 - object->work[1]));
                if (temp_f30 > 1.0f) {
                    temp_f30 = 1.0f;
                }
                temp_f31 = temp_r31->unk18.z;
                temp_r31->unk30.z -= (175.0f / REFRESH_RATE) * temp_f30;
#if VERSION_PAL
                temp_r31->unk30.y += (70.0f / REFRESH_RATE) * temp_f30;
#else
                temp_r31->unk30.y += (70.0f / REFRESH_RATE_OFF_BY_1) * temp_f30;
#endif
                temp_r31->unk18.x = object->trans.x + (temp_r31->unk30.z * sind(temp_r31->unk30.y));
                temp_r31->unk18.z = object->trans.z + (temp_r31->unk30.z * cosd(temp_r31->unk30.y));
#if VERSION_PAL
                temp_r31->unk18.y -= (500.0f / REFRESH_RATE) * temp_f30;
#else
                temp_r31->unk18.y -= (500.0f / REFRESH_RATE_OFF_BY_1) * temp_f30;
#endif
                temp_r31->unk24.x = 0;
                temp_r31->unk24.y = 0;
                temp_r31->unk24.z = 0.96f * temp_r31->unk0.z;
            }
            else {
                temp_r31->unk18.z += temp_r31->unk24.z * REFRESH_FREQ;
            }
            temp_r31->unkC.x = object->trans.x;
            temp_r31->unkC.y = object->trans.y;
            temp_r31->unkC.z = object->trans.z;
            sp2C.x = object->trans.x;
            sp2C.y = object->trans.y;
            sp2C.z = object->trans.z;
            if (temp_r31->unk48[0] < 0) {
                temp_r31->unk48[0] = HuAudFXEmiterPlay(1362, &sp2C);
            }
            if (temp_r31->unk48[1] < 0) {
                temp_r31->unk48[1] = HuAudFXEmiterPlay(1356, &sp2C);
            }
            if (object->work[1] < REFRESH_RATE_F * 3) {
                break;
            }
            object->work[0] = 1;
            object->work[1] = 0;
            break;

        case 1:
            temp_r31->unk24.z *= 0.6f;
            temp_r31->unk18.z += (temp_r31->unk24.z * REFRESH_FREQ);
            temp_r31->unk18.x += (temp_r31->unk24.z * REFRESH_FREQ);
            temp_r31->unkC.x = object->trans.x;
            temp_r31->unkC.y = object->trans.y;
            temp_r31->unkC.z = object->trans.z;
            if (object->work[1] < REFRESH_RATE_F) {
                break;
            }
            object->work[0] = 2;
            object->work[1] = 0;
            break;

        case 2:
#if VERSION_PAL
            temp_r31->unk3C.x += (90.0f / REFRESH_RATE_F);
#else
            temp_r31->unk3C.x += (90.0f / REFRESH_RATE_OFF_BY_1);
#endif
            temp_r31->unk0.z = 1000.0 * cosd(temp_r31->unk3C.x);
            temp_r31->unk0.y = 1000.0 * sind(temp_r31->unk3C.x);
            temp_r31->unkC.x = object->trans.x;
            temp_r31->unkC.y = object->trans.y;
            temp_r31->unkC.z = object->trans.z;
            if (object->work[1] < REFRESH_RATE_F * 2) {
                break;
            }
            object->work[0] = 3;
            object->work[1] = 0;
            temp_r31->unk3C.x = 180;
            break;

        case 3:
#if VERSION_PAL
            temp_r31->unk3C.z += (180.0f / REFRESH_RATE_F);
#else
            temp_r31->unk3C.z += (180.0f / REFRESH_RATE_OFF_BY_1);
#endif
            temp_f31 = REFRESH_FREQ * object->work[1];
            temp_f31 = 1.0f - (temp_f31 * temp_f31);
            temp_r31->unkC.x += temp_f31 * (object->trans.x - temp_r31->unkC.x);
            temp_r31->unkC.y += temp_f31 * (object->trans.y - temp_r31->unkC.y);
            temp_r31->unkC.z += temp_f31 * (object->trans.z - temp_r31->unkC.z);
            if (object->work[1] < REFRESH_RATE_F) {
                break;
            }
            lbl_1_bss_F4.x = temp_r31->unkC.x;
            lbl_1_bss_F4.y = temp_r31->unkC.y;
            lbl_1_bss_F4.z = temp_r31->unkC.z;
            lbl_1_bss_100.x = temp_r31->unk18.x;
            lbl_1_bss_100.y = temp_r31->unk18.y;
            lbl_1_bss_100.z = temp_r31->unk18.z;
            object->work[0] = 4;
            object->work[1] = 0;
            break;

        case 4:
#if VERSION_PAL
            temp_r31->unk3C.z += (180.0f / REFRESH_RATE_F);
#else
            temp_r31->unk3C.z += (180.0f / REFRESH_RATE_OFF_BY_1);
#endif
            if (object->work[1] > REFRESH_RATE_F * 0.7f) {
                if (temp_r31->unk48[0] >= 0) {
                    HuAudFXStop(temp_r31->unk48[0]);
                    temp_r31->unk48[0] = -1;
                }
                if (temp_r31->unk48[1] >= 0) {
                    HuAudFXStop(temp_r31->unk48[1]);
                    temp_r31->unk48[1] = -1;
                }
            }
            if (object->work[1] < REFRESH_RATE_F * 4) {
                break;
            }
            object->work[0] = 5;
            object->work[1] = 0;
            break;

        default:
            object->work[0] = 5;
            object->func = fn_1_A334;
            break;
    }
    omSetRot(object, -temp_r31->unk3C.x, temp_r31->unk3C.y, temp_r31->unk3C.z);
    if (object->trans.y < 12150.0f) {
        sp20.x = object->trans.x;
        sp20.y = object->trans.y;
        sp20.z = object->trans.z + 10;
        fn_1_A4E8(object->model[1], &sp20, 4);
        sp20.x = sp8.x = object->trans.x;
        sp20.z = object->trans.z;
        sp8.z = object->trans.z - 10;
        sp20.y = object->trans.y + 250.0f;
        sp8.y = object->trans.y;
        sp14.x = 0;
        sp14.y = 0;
        sp14.z = 1;
        Hu3DShadowPosSet(&sp20, &sp14, &sp8);
    }
    if (temp_r31->unk48[0] >= 0) {
        sp2C.x = object->trans.x - 30;
        sp2C.y = object->trans.y;
        sp2C.z = object->trans.z + 25;
        HuAudFXEmiterUpDate(temp_r31->unk48[0], &sp2C);
    }
    if (temp_r31->unk48[1] < 0) {
        sp2C.x = object->trans.x + 30;
        sp2C.y = object->trans.y;
        sp2C.z = object->trans.z + 25;
        HuAudFXEmiterUpDate(temp_r31->unk48[1], &sp2C);
    }
    if (object->work[0] < 4) {
        fn_1_84C4(temp_r31->unk18.x, temp_r31->unk18.y, temp_r31->unk18.z, temp_r31->unkC.x, temp_r31->unkC.y, temp_r31->unkC.z);
    }
    if (fn_1_C43C() == 5) {
        object->func = fn_1_A334;
    }
}

void fn_1_A334(omObjData *object)
{
    Hu3DModelAttrSet(object->model[1], HU3D_ATTR_DISPOFF);
    Hu3DModelAttrSet(object->model[0], HU3D_ATTR_DISPOFF);
}

void fn_1_A37C(ModelData *model, ParticleData *particle, Mtx matrix)
{
    HU3DPARTICLEDATA *temp_r31;
    s32 temp_r29;
    if (particle->unk_00 == 0) {
        particle->unk_00++;
        temp_r31 = particle->data;
        for (temp_r29 = 0; temp_r29 < particle->unk_30; temp_r29++, temp_r31++) {
            temp_r31->time = 0;
            temp_r31->unk2C = 0;
            temp_r31->unk40.a = 0;
        }
    }
    else {
        temp_r31 = particle->data;
        for (temp_r29 = 0; temp_r29 < particle->unk_30; temp_r29++, temp_r31++) {
            if (temp_r31->time) {
                temp_r31->unk34.x += temp_r31->unk08.x;
                temp_r31->unk34.y += temp_r31->unk08.y;
                temp_r31->unk34.z += temp_r31->unk08.z;
                temp_r31->unk2C += temp_r31->unk14.x;
                temp_r31->unk14.y -= temp_r31->unk14.z;
                temp_r31->unk40.a = temp_r31->unk14.y;
                if (--temp_r31->time == 0) {
                    temp_r31->time = 0;
                    temp_r31->unk2C = 0;
                    temp_r31->unk40.a = 0;
                }
            }
        }
        DCStoreRange(particle->data, particle->unk_30 * sizeof(HU3DPARTICLEDATA));
    }
}

void fn_1_A4E8(s32 arg0, Vec *arg1, u32 arg2)
{
    float temp_f31;
    HU3DPARTICLEDATA *temp_r31;
    ParticleData *temp_r30;
    s32 temp_r29;
    temp_r30 = Hu3DData[arg0].unk_120;
    if (temp_r30->unk_00) {
        temp_r31 = temp_r30->data;
        for (temp_r29 = 0; temp_r29 < temp_r30->unk_30; temp_r29++, temp_r31++) {
            if (temp_r31->time != 0) {
                continue;
            }
            temp_r31->time = REFRESH_RATE_F * (((1.5f / 1000.0f) * frandmod(1000)) + 1.0f);
            temp_r31->unk34.x = arg1->x;
            temp_r31->unk34.y = 12000;
            temp_r31->unk34.z = arg1->z;
            temp_r31->unk08.x = REFRESH_FREQ * ((0.6f * frandmod(1000)) - 300.0f);
            temp_r31->unk08.y = REFRESH_FREQ * ((0.04f * frandmod(1000)) + 10.0f);
            temp_r31->unk08.z = 0;
            temp_r31->unk14.x = 0.3f + ((3.0f / 1000.0f) * frandmod(1000));
            temp_r31->unk2C = 10;
            temp_r31->unk40.a = frandmod(127) + 64;
            temp_r31->unk14.y = temp_r31->unk40.a;
            temp_r31->unk14.z = temp_r31->unk14.y * (1.0f / temp_r31->time);
            temp_f31 = frandmod(1000) * (1.0f / 1000.0f);
            temp_r31->unk40.r = (temp_f31 * 55) + 200;
            temp_r31->unk40.g = (temp_f31 * 50) + 205;
            temp_r31->unk40.b = (temp_f31 * 5) + 250;
            if (--arg2 == 0) {
                break;
            }
        }
    }
}

