mariopartyrd/partyboard/src/REL/m408Dll/camera.c
#if VERSION_PAL
#define MIN_PARTICLE_00_VALUE 282.5f
#define MAX_PARTICLE_00_VALUE 500.0f
#define PARTICLE_00_CAP 501
#else
#define MIN_PARTICLE_00_VALUE 339.0f
#define MAX_PARTICLE_00_VALUE 600.0f
#define PARTICLE_00_CAP 601
#endif

void fn_1_A894(ModelData *model, ParticleData *particle, Mtx matrix)
{
    float temp_f31;
    float temp_f30;
    HU3DPARTICLEDATA *temp_r31;
    s32 temp_r29;
    float sp14[][6] = {
        { 600, 1, 0.95, 0.8, 1, 0 },
        { 600, 1, 0.6, 0.9, 0.3, 0 },
        { 13, 1, 1, 1, 0.5, 0 },
    };
    Vec sp8;
    if (particle->unk_00 == 0) {
        particle->unk_00++;
        temp_r31 = particle->data;
        for (temp_r29 = 0; temp_r29 < particle->unk_30; temp_r29++, temp_r31++) {
            temp_r31->time = 1;
            temp_r31->unk2C = sp14[particle->unk_02][0];
            temp_r31->unk40.r = 255 * sp14[particle->unk_02][1];
            temp_r31->unk40.g = 255 * sp14[particle->unk_02][2];
            temp_r31->unk40.b = 255 * sp14[particle->unk_02][3];
            temp_r31->unk40.a = 255 * sp14[particle->unk_02][4];
            temp_f31 = -70;
            temp_f30 = -10;
            temp_r31->unk08.x = sind(temp_f30) * cosd(temp_f31);
            temp_r31->unk08.y = -sind(temp_f31);
            temp_r31->unk08.z = cosd(temp_f30) * cosd(temp_f31);
        }
    }
    else {
        particle->unk_00++;
        if (particle->unk_00 < MIN_PARTICLE_00_VALUE) {
            return;
        }
        if (particle->unk_00 >= MAX_PARTICLE_00_VALUE) {
            particle->unk_00 = PARTICLE_00_CAP;
            temp_r31 = particle->data;
            for (temp_r29 = 0; temp_r29 < particle->unk_30; temp_r29++, temp_r31++) {
                temp_r31->time = 0;
                temp_r31->unk2C = 0;
                temp_r31->unk40.a = 0;
            }
        }
        else {
            temp_r31 = particle->data;
            for (temp_r29 = 0; temp_r29 < particle->unk_30; temp_r29++, temp_r31++) {
                if (temp_r31->time == 0) {
                    continue;
                }
                sp8.x = sind(CRot.y) * cosd(CRot.x);
                sp8.y = -sind(CRot.x);
                sp8.z = cosd(CRot.y) * cosd(CRot.x);
                if (particle->unk_02 < 2) {
                    temp_f31 = 4500;
                    temp_r31->unk34.x = (Center.x + (temp_r31->unk08.x * temp_f31)) + (sp8.x * CZoom);
                    temp_r31->unk34.y = (Center.y + (temp_r31->unk08.y * temp_f31)) + (sp8.y * CZoom);
                    temp_r31->unk34.z = (Center.z + (temp_r31->unk08.z * temp_f31)) + (sp8.z * CZoom);
                    if (particle->unk_02 != 0) {
                        temp_f31 = -((sp8.x * temp_r31->unk08.x) + (sp8.y * temp_r31->unk08.y) + (sp8.z * temp_r31->unk08.z));
                        if (temp_f31 > 0.77f) {
                            temp_f30 = (1.0f / 0.23f) * (temp_f31 - 0.77f);
                            temp_r31->unk2C = 1400 * temp_f30;
                            temp_r31->unk40.a = (32.0f * temp_f30) + 16.0f;
                        }
                        else {
                            temp_r31->unk2C = 0;
                        }
                    }
                }
                else {
                    temp_f31 = CZoom - 10;
                    temp_r31->unk34.x = (sp8.x * temp_f31) + Center.x;
                    temp_r31->unk34.y = (sp8.y * temp_f31) + Center.y;
                    temp_r31->unk34.z = (sp8.z * temp_f31) + Center.z;
                    temp_f31 = -((sp8.x * temp_r31->unk08.x) + (sp8.y * temp_r31->unk08.y) + (sp8.z * temp_r31->unk08.z));
                    if (temp_f31 > 0.9f) {
                        temp_f30 = 10.0f * (temp_f31 - 0.9f);
                        temp_r31->unk40.a = temp_f30 * 210.0f;
                    }
                    else {
                        temp_r31->unk40.a = 0;
                    }
                }
            }
            DCStoreRange(particle->data, particle->unk_30 * sizeof(HU3DPARTICLEDATA));
        }
    }
}

void fn_1_AFF4(ModelData *model, ParticleData *particle, Mtx matrix)
{
    float temp_f31;
    float temp_f30;
    HU3DPARTICLEDATA *temp_r30;
    s32 temp_r29;
    Vec sp20;
    Vec sp14;
    Vec sp8;
    if (particle->unk_00 == 0) {
        particle->unk_00++;
        temp_f31 = -70;
        temp_f30 = -10;
        particle->unk_04.x = sind(temp_f30) * cosd(temp_f31);
        particle->unk_04.y = -sind(temp_f31);
        particle->unk_04.z = cosd(temp_f30) * cosd(temp_f31);
        temp_f31 = 0;
        temp_r30 = particle->data;
        for (temp_r29 = 0; temp_r29 < particle->unk_30; temp_r29++, temp_r30++) {
            temp_r30->time = 1;
            temp_f31 += 1.0f / particle->unk_30;
            temp_r30->unk2C = 40.0f + ((1.0f - temp_f31) * (100.0f + frandmod(1000)));
            temp_r30->unk40.r = frandmod(127) + 128;
            temp_r30->unk40.g = frandmod(127) + 128;
            temp_r30->unk40.b = frandmod(127) + 128;
            temp_r30->unk40.a = frandmod(16) + 16;
        }
    }
    else {
        particle->unk_00++;
        if (particle->unk_00 < MIN_PARTICLE_00_VALUE) {
            return;
        }
        if (particle->unk_00 >= MAX_PARTICLE_00_VALUE) {
            particle->unk_00 = PARTICLE_00_CAP;
            temp_r30 = particle->data;
            for (temp_r29 = 0; temp_r29 < particle->unk_30; temp_r29++, temp_r30++) {
                temp_r30->time = 0;
                temp_r30->unk2C = 0;
                temp_r30->unk40.a = 0;
            }
        }
        else {
            sp20.x = sind(CRot.y) * cosd(CRot.x);
            sp20.y = -sind(CRot.x);
            sp20.z = cosd(CRot.y) * cosd(CRot.x);
            temp_f31 = -((-particle->unk_04.x * -sp20.x) + (-particle->unk_04.y * -sp20.y) + (-particle->unk_04.z * -sp20.z));
            sp14.x = -sp20.x + (-2.0f * particle->unk_04.x * temp_f31);
            sp14.y = -sp20.y + (-2.0f * particle->unk_04.y * temp_f31);
            sp14.z = -sp20.z + (-2.0f * particle->unk_04.z * temp_f31);
            temp_f31 = 4500;
            sp8.x = (Center.x + (particle->unk_04.x * temp_f31)) + (sp20.x * CZoom);
            sp8.y = (Center.y + (particle->unk_04.y * temp_f31)) + (sp20.y * CZoom);
            sp8.z = (Center.z + (particle->unk_04.z * temp_f31)) + (sp20.z * CZoom);
            temp_r30 = particle->data;
            temp_f30 = 0;
            for (temp_r29 = 0; temp_r29 < particle->unk_30; temp_r29++, temp_r30++) {
                if (temp_r30->time == 0) {
                    continue;
                }
                temp_f30 += 1.0f / particle->unk_30;
                temp_f31 = 10.0f * (430.0f * (1.0f - ((1.0f - temp_f30) * (1.0f - temp_f30))));
                temp_r30->unk34.x = sp8.x + (sp14.x * temp_f31);
                temp_r30->unk34.y = sp8.y + (sp14.y * temp_f31);
                temp_r30->unk34.z = sp8.z + (sp14.z * temp_f31);
            }
            DCStoreRange(particle->data, particle->unk_30 * sizeof(HU3DPARTICLEDATA));
        }
    }
}

