mariopartyrd/partyboard/src/REL/m408Dll/camera.c
void fn_1_B700(s16 arg0, u32 arg1)
{
    float temp_f31;
    float temp_f30;
    HU3DPARTICLEDATA *temp_r31;
    ParticleData *temp_r30;
    s32 temp_r29;
    s32 temp_r27;
    float sp1C[] = { 0.4f, 0.21f, 0.16f, 1.0f };
    float spC[] = { 0.15f, 0.6f, 1.3f, 1.0f };
    s16 sp2C[] = { 1, 0, 2, 0, 0, 1, 2, 0, 0, 1, 2, 1, 0, 0, 1, 2, 0, 1, 2, -1 };
    arg1 &= 0x3;
    temp_r30 = Hu3DData[arg0].unk_120;
    temp_r30->unk_00 = 1;
    temp_f31 = -70;
    temp_f30 = -10;
    temp_r30->unk_04.x = sind(temp_f30) * cosd(temp_f31);
    temp_r30->unk_04.y = -sind(temp_f31);
    temp_r30->unk_04.z = cosd(temp_f30) * cosd(temp_f31);
    temp_r31 = temp_r30->data;
    for (temp_r27 = 0; temp_r27 < temp_r30->unk_30; temp_r27++, temp_r31++) {
        temp_r31->time = 1;
        temp_r31->unk02 = arg1;
        for (temp_r29 = 0; sp2C[temp_r29] >= 0; temp_r29++) {
            if (arg1 != sp2C[temp_r29]) {
                continue;
            }
            if (lbl_1_bss_A4[temp_r29] == NULL) {
                break;
            }
        }
        if (sp2C[temp_r29] < 0) {
            temp_r31->unk2C = 0;
            temp_r31->unk40.a = 0;
            continue;
        }
        lbl_1_bss_A4[temp_r29] = temp_r31;
        lbl_1_bss_A0++;
        temp_r31->unk2C = 800.0f * (spC[arg1] * (1.0f + ((0.7f / 1000.0f) * frandmod(1000))));
        temp_r31->unk40.r = frandmod(160) + 32;
        temp_r31->unk40.g = frandmod(160) + 32;
        temp_r31->unk40.b = frandmod(160) + 32;
        temp_r31->unk40.a = (255.0f * sp1C[arg1]) - frandmod(16);
    }
    lbl_1_bss_94[arg1] = temp_r30->data;
    lbl_1_bss_88[arg1] = temp_r30->unk_30;
}

void fn_1_BB94(void)
{
    float temp_f31;
    float temp_f30;
    HU3DPARTICLEDATA *temp_r31;
    s32 temp_r30;
    float sp18[] = { 0.02f, 0.08f, 0.07f, 0.5f };
    float sp8[] = { 0.0009f, 0.00020000001f, 0.00001f, 0.0005f };
    temp_f31 = 0.1f;
    for (temp_r30 = 0; temp_r30 < lbl_1_bss_A0; temp_r30++) {
        temp_r31 = lbl_1_bss_A4[temp_r30];
        temp_f30 = 0.5f * (sp18[temp_r31->unk02] * (1.0f + (frandmod(1000) * sp8[temp_r31->unk02])));
        temp_f31 += temp_f30;
        temp_r31->unk14.x = temp_f31;
        temp_f31 += temp_f30;
    }
    temp_f31 = 1.0f / temp_f31;
    for (temp_r30 = 0; temp_r30 < lbl_1_bss_A0; temp_r30++) {
        temp_r31 = lbl_1_bss_A4[temp_r30];
        temp_r31->unk14.x *= temp_f31;
        temp_r31->unk2C *= (0.8f - (0.4f * temp_r31->unk14.x));
        temp_r31->unk14.x = 10.0f * (400.0f * temp_r31->unk14.x);
    }
    for (temp_r30 = 0; temp_r30 < 3; temp_r30++) {
        DCStoreRangeNoSync(lbl_1_bss_94[temp_r30], lbl_1_bss_88[temp_r30] * sizeof(HU3DPARTICLEDATA));
    }
    PPCSync();
}

void fn_1_BDE0(void)
{
    float temp_f31;
    float temp_f30;
    HU3DPARTICLEDATA *temp_r31;
    s32 temp_r30;
    Vec sp2C;
    Vec sp20;
    Vec sp14;
    Vec sp8;
    temp_r31 = lbl_1_bss_A4[0];
    temp_r31->time++;
    if (temp_r31->time < MIN_PARTICLE_00_VALUE) {
        return;
    }
    if (temp_r31->time >= MAX_PARTICLE_00_VALUE) {
        temp_r31->time = PARTICLE_00_CAP;
        for (temp_r30 = 0; temp_r30 < lbl_1_bss_A0; temp_r30++) {
            temp_r31 = lbl_1_bss_A4[temp_r30];
            temp_r31->time = 0;
            temp_r31->unk2C = 0;
            temp_r31->unk40.a = 0;
        }
        return;
    }
    sp2C.x = sind(CRot.y) * cosd(CRot.x);
    sp2C.y = -sind(CRot.x);
    sp2C.z = cosd(CRot.y) * cosd(CRot.x);
    temp_f31 = -70;
    temp_f30 = -10;
    sp20.x = sind(temp_f30) * cosd(temp_f31);
    sp20.y = -sind(temp_f31);
    sp20.z = cosd(temp_f30) * cosd(temp_f31);
    temp_f31 = 4500;
    sp8.x = (Center.x + (sp20.x * temp_f31)) + (sp2C.x * CZoom);
    sp8.y = (Center.y + (sp20.y * temp_f31)) + (sp2C.y * CZoom);
    sp8.z = (Center.z + (sp20.z * temp_f31)) + (sp2C.z * CZoom);
    temp_f31 = -((-sp20.x * -sp2C.x) + (-sp20.y * -sp2C.y) + (-sp20.z * -sp2C.z));
    sp14.x = -sp2C.x + (-2.0f * sp20.x * temp_f31);
    sp14.y = -sp2C.y + (-2.0f * sp20.y * temp_f31);
    sp14.z = -sp2C.z + (-2.0f * sp20.z * temp_f31);
    if (temp_f31 > 0.5f) {
        temp_f30 = 3.0f - (2.0f * temp_f31);
    }
    else {
        temp_f30 = 1.0f;
    }
    for (temp_r30 = 0; temp_r30 < lbl_1_bss_A0; temp_r30++) {
        temp_r31 = lbl_1_bss_A4[temp_r30];
        temp_r31->unk34.x = sp8.x + (temp_f30 * (sp14.x * temp_r31->unk14.x));
        temp_r31->unk34.y = sp8.y + (temp_f30 * (sp14.y * temp_r31->unk14.x));
        temp_r31->unk34.z = sp8.z + (temp_f30 * (sp14.z * temp_r31->unk14.x));
    }
    for (temp_r30 = 0; temp_r30 < 3; temp_r30++) {
        DCStoreRangeNoSync(lbl_1_bss_94[temp_r30], lbl_1_bss_88[temp_r30] * sizeof(HU3DPARTICLEDATA));
    }
    PPCSync();
}

void fn_1_C3C0(Vec *arg0, Vec *arg1)
{
    arg0->x = lbl_1_bss_110->trans.x;
    arg0->y = lbl_1_bss_110->trans.y;
    arg0->z = lbl_1_bss_110->trans.z;
    arg1->x = lbl_1_bss_110->rot.x;
    arg1->y = lbl_1_bss_110->rot.y;
    arg1->z = lbl_1_bss_110->rot.z;
}

u32 fn_1_C43C(void)
{
    return lbl_1_bss_10C;
}
